In [1]:
# filter data with query() method

import pandas as pd
df = pd.read_csv("emp.csv" , index_col = "ename")
df.head()

          eno  esal      eadrs
ename
nikhil     10  1000       doon
prakriti   20  2000      delhi
arun       30  3000  rishikesh
riya       40  4000     shimla
tannu      50  5000       agra

In [2]:
# select all employes from doon

c = df["eadrs"] == "doon"

df[c]

        eno  esal eadrs
ename
nikhil   10  1000  doon

In [3]:
# using query()
# query() - used to filter rows from database

# note -->
#  paramtr dhold contain valid string
#  col name shold not contain space

In [4]:
import pandas as pd
df = pd.read_csv("emp.csv" , index_col = "ename")
df.head()

          eno  esal      eadrs
ename
nikhil     10  1000       doon
prakriti   20  2000      delhi
arun       30  3000  rishikesh
riya       40  4000     shimla
tannu      50  5000       agra

In [5]:
df.query('eadrs == "doon"')   # strng may create problm

        eno  esal eadrs
ename
nikhil   10  1000  doon

In [6]:
# not from doon

df.query("eadrs != 'doon'")

          eno  esal      eadrs
ename
prakriti   20  2000      delhi
arun       30  3000  rishikesh
riya       40  4000     shimla
tannu      50  5000       agra

In [7]:
# salary > 3000

df.query("esal > 3000")

       eno  esal   eadrs
ename
riya    40  4000  shimla
tannu   50  5000    agra

In [8]:
# multiple conditions

# doon emp salry > 3500

df.query("eadrs == 'doon' and esal > 3500")

Empty DataFrame
Columns: [eno, esal, eadrs]
Index: []

In [9]:
# not from doon or salary>5000

df.query("eadrs != 'doon' or esal > 5000")

          eno  esal      eadrs
ename
prakriti   20  2000      delhi
arun       30  3000  rishikesh
riya       40  4000     shimla
tannu      50  5000       agra

In [10]:
# use of in , not in

df.query("eadrs == ['doon' , 'delhi']")

          eno  esal  eadrs
ename
nikhil     10  1000   doon
prakriti   20  2000  delhi

In [11]:
# or

df.query("eadrs in  ['delhi' , 'doon']")

          eno  esal  eadrs
ename
nikhil     10  1000   doon
prakriti   20  2000  delhi

In [12]:
# if column contain space

df.columns = ["a" , "b" , "a c"]

In [16]:
df

           a     b        a c
ename
nikhil    10  1000       doon
prakriti  20  2000      delhi
arun      30  3000  rishikesh
riya      40  4000     shimla
tannu     50  5000       agra

In [17]:
df.query("a c == 'doon'")

SyntaxError: invalid syntax (<unknown>, line 1)

In [18]:
# how to resolve 
# use back quotes

df.query("`a c`== 'doon'")

         a     b   a c
ename
nikhil  10  1000  doon

In [20]:
# apply() method for rows

# same as series

# double salary of each emp

import pandas as pd
df = pd.read_csv("emp.csv" , index_col = "ename")
df.head()

          eno  esal      eadrs
ename
nikhil     10  1000       doon
prakriti   20  2000      delhi
arun       30  3000  rishikesh
riya       40  4000     shimla
tannu      50  5000       agra

In [21]:
df["esal"] = df["esal"].apply(lambda x: 2*x)

In [22]:
df

          eno   esal      eadrs
ename
nikhil     10   2000       doon
prakriti   20   4000      delhi
arun       30   6000  rishikesh
riya       40   8000     shimla
tannu      50  10000       agra

In [23]:
# sample()  - random row from dataframe

df.sample()

          eno  esal  eadrs
ename
prakriti   20  4000  delhi

In [24]:
# 3 random rows

df.sample(3)

          eno   esal  eadrs
ename
prakriti   20   4000  delhi
tannu      50  10000   agra
nikhil     10   2000   doon

In [25]:
# 25% sample

df.sample(frac = 0.25)

       eno  esal      eadrs
ename
arun    30  6000  rishikesh

In [26]:
df

          eno   esal      eadrs
ename
nikhil     10   2000       doon
prakriti   20   4000      delhi
arun       30   6000  rishikesh
riya       40   8000     shimla
tannu      50  10000       agra

In [27]:
df.sample(1 , axis = 1)    # for column

          eno
ename
nikhil     10
prakriti   20
arun       30
riya       40
tannu      50

In [28]:
# nlargest()

# 3 highest salary

df.nlargest(3 , columns = "esal")

       eno   esal      eadrs
ename
tannu   50  10000       agra
riya    40   8000     shimla
arun    30   6000  rishikesh

In [29]:
df = pd.read_csv("emp.csv", index_col = "ename")


df.nsmallest(2 , columns = "esal")

          eno  esal  eadrs
ename
nikhil     10  1000   doon
prakriti   20  2000  delhi

### filter using where()

In [30]:
# return full dataframe

# select rows where adrs  = doon

c = df["eadrs"] =="doon"

df.where(c)

           eno    esal eadrs
ename
nikhil    10.0  1000.0  doon
prakriti   NaN     NaN   NaN
arun       NaN     NaN   NaN
riya       NaN     NaN   NaN
tannu      NaN     NaN   NaN

In [32]:
df

          eno  esal      eadrs
ename
nikhil     10  1000       doon
prakriti   20  2000      delhi
arun       30  3000  rishikesh
riya       40  4000     shimla
tannu      50  5000       agra

In [33]:
df.loc["prakriti","esal"]

2000

In [34]:
# string method in pandas

import pandas as pd
df = pd.read_csv("emp.csv" , index_col = "ename")
df.head()

          eno  esal      eadrs
ename
nikhil     10  1000       doon
prakriti   20  2000      delhi
arun       30  3000  rishikesh
riya       40  4000     shimla
tannu      50  5000       agra

In [35]:
df["eadrs"].str.upper()

ename
nikhil           DOON
prakriti        DELHI
arun        RISHIKESH
riya           SHIMLA
tannu            AGRA
Name: eadrs, dtype: object

In [36]:
df["eadrs"].str.title()

ename
nikhil           Doon
prakriti        Delhi
arun        Rishikesh
riya           Shimla
tannu            Agra
Name: eadrs, dtype: object

In [37]:
# for particulr str or multiple index not need to write str

df["eadrs"][2].upper()
df["eadrs"][[2,3]].replace("o" , "r")

ename
arun    rishikesh
riya       shimla
Name: eadrs, dtype: object

In [38]:
df["eadrs"].str.len()

ename
nikhil      4
prakriti    5
arun        9
riya        6
tannu       4
Name: eadrs, dtype: int64

In [39]:
df[df["eadrs"].str.endswith("i")]

          eno  esal  eadrs
ename
prakriti   20  2000  delhi